tutorials/verificationAndValidation/atmosphericModels/atmFlatTerrain/precursor/0.orig/qPlant.template
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      qPlant;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField  uniform  Q_PLANT;

boundaryField
{
    "bottom|top"
    {
        type            fixedValue;
        value           uniform 0;
    }

    "inlet|outlet|left|right"
    {
        type            cyclic;
    }
}


// ************************************************************************* //
